# vim: syntax=ruby filetype=ruby

tap 'adoptopenjdk/openjdk'
tap 'azure/draft'
tap 'bazelbuild/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'weaveworks/tap'

brew 'ack'
brew 'openssl@1.1'
brew 'python@3.9'
brew 'asciinema'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'azure-cli'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'bats'
brew 'bazel'
brew 'ccat'
brew 'libtool'
brew 'cfssl'
brew 'cmake'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'docker-machine-driver-hyperkit'
brew 'entr'
brew 'etcd'
brew 'fd'
brew 'findutils'
brew 'fortio'
brew 'fzf'
brew 'gettext'
brew 'gawk'
brew 'gcc'
brew 'gdb'
brew 'git'
brew 'git-secrets'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'gnupg'
brew 'go'
brew 'grep'
brew 'grpcurl'
brew 'ncurses'
brew 'grv'
brew 'gti'
brew 'helm'
brew 'htop'
brew 'hub'
brew 'jenv'
brew 'jq'
brew 'kubernetes-cli'
brew 'kube-ps1'
brew 'kubectx'
brew 'kustomize'
brew 'ldns'
brew 'libyaml'
brew 'lolcat'
brew 'maven'
brew 'mercurial'
brew 'minikube'
brew 'protobuf'
brew 'mitmproxy'
brew 'ncdu'
brew 'nginx'
brew 'ninja'
brew 'node'
brew 'openssh'
brew 'parallel'
brew 'pinentry-mac'
brew 'proctools'
brew 'prototool'
brew 'pstree'
brew 'pv'
brew 'ripgrep'
brew 'ruby'
brew 'rustup-init'
brew 'screen'
brew 'shellcheck'
brew 'shfmt'
brew 'skaffold'
brew 'sleepwatcher'
brew 'telnet'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tree'
brew 'unrar'
brew 'watch'
brew 'wdiff'
brew 'wget'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'azure/draft/draft'
brew 'weaveworks/tap/eksctl'

cask '1password'
cask 'adoptopenjdk'
cask 'adoptopenjdk11'
cask 'chai'
cask 'cleanmymac'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'grammarly'
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'microsoft-teams'
cask 'microsoft-office'
cask 'slack'
cask 'sourcetree'
cask 'spectacle'
cask 'visual-studio-code'
cask 'zoom'
